tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/wdt_regs.h
/**
 * @file
 * @brief   Type definitions for the Watchdog Timer Peripheral
 *
 */
/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-10-10 19:53:06 -0500 (Mon, 10 Oct 2016) $
 * $Revision: 24677 $
 *
 *
 **************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_WDT_REGS_H_
#define _MXC_WDT_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif


///@cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
///@endcond

/**
 * @ingroup     wdt0
 * @defgroup    wdt_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions
 * @{
 */
/*
   Typedefed structure(s) for module registers (per instance or section) with direct 32-bit
   access to each register in module.
*/
/**
 * Structure type to access the WDT Registers, see #MXC_WDT_GET_WDT(i) to get a pointer to the WDT[i] register structure.
 * @note For the Always-On Watch Dog Timer, see \ref wdt2. 
 */
typedef struct {
    __IO uint32_t ctrl;                                 /**< <tt>\b 0x0000:</tt> WDT_CTRL Register - WDT Control Register                                   */
    __IO uint32_t clear;                                /**< <tt>\b 0x0004:</tt> WDT_CLEAR Register - WDT Clear Register to prevent a WDT Reset (Feed Dog)  */
    __IO uint32_t flags;                                /**< <tt>\b 0x0008:</tt> WDT_FLAGS Register - WDT Interrupt and Reset Flags                         */
    __IO uint32_t enable;                               /**< <tt>\b 0x000C:</tt> WDT_ENABLE Register - WDT Reset and Interrupt Enable/Disable Controls      */
    __R  uint32_t rsv010;                               /**< <tt>\b 0x0010:</tt> RESERVED, DO NOT MODIFY.                                                   */
    __IO uint32_t lock_ctrl;                            /**< <tt>\b 0x0014:</tt> WDT_LOCK_CTRL Register - Lock for Control Register                         */
} mxc_wdt_regs_t;
/**@} end of group wdt_registers.*/

/*
   Register offsets for module WDT.
*/
/**
 * @ingroup    wdt_registers
 * @defgroup   WDT_Register_Offsets Register Offsets
 * @brief      Watchdog Timer Register Offsets from the WDT[n] Base Peripheral Address, where n is between 0 and #MXC_CFG_WDT_INSTANCES for the \MXIM_Device. 
 * @details    Use #MXC_WDT_GET_BASE(i) to get the base address for a specific watchdog timer instance. 
 * @note       See \ref wdt2 for the Always-On Watchdog Timer Peripheral driver. 
 * @{
 */
#define MXC_R_WDT_OFFS_CTRL                                 ((uint32_t)0x00000000UL)    /**< Offset from the WDT[i] Base Peripheral Address : WDT_CTRL : <tt>\b 0x0000 </tt>      */
#define MXC_R_WDT_OFFS_CLEAR                                ((uint32_t)0x00000004UL)    /**< Offset from the WDT[i] Base Peripheral Address : WDT_CLEAR : <tt>\b 0x0004 </tt>     */
#define MXC_R_WDT_OFFS_FLAGS                                ((uint32_t)0x00000008UL)    /**< Offset from the WDT[i] Base Peripheral Address : WDT_FLAGS : <tt>\b 0x0008 </tt>     */
#define MXC_R_WDT_OFFS_ENABLE                               ((uint32_t)0x0000000CUL)    /**< Offset from the WDT[i] Base Peripheral Address : WDT_ENABLE : <tt>\b 0x000C </tt>    */
#define MXC_R_WDT_OFFS_LOCK_CTRL                            ((uint32_t)0x00000014UL)    /**< Offset from the WDT[i] Base Peripheral Address : WDT_LOCK_CTRL : <tt>\b 0x0014 </tt> */
/**@} end of group WDT_Register_Offsets */

/*
   Field positions and masks for module WDT.
*/
/**
 * @ingroup  wdt_registers
 * @defgroup WDT_CTRL_Register WDT_CTRL Register
 * @brief    Field Positions and Bit Masks for the WDT_CTRL register
 * @{
 */
#define MXC_F_WDT_CTRL_INT_PERIOD_POS                       0                                                                   /**< INT_PERIOD Field Position */
#define MXC_F_WDT_CTRL_INT_PERIOD                           ((uint32_t)(0x0000000FUL << MXC_F_WDT_CTRL_INT_PERIOD_POS))         /**< INT_PERIOD Field Mask - This field is used to set the interrupt period on the WDT. */
#define MXC_F_WDT_CTRL_RST_PERIOD_POS                       4                                                                   /**< RST_PERIOD Field Position */
#define MXC_F_WDT_CTRL_RST_PERIOD                           ((uint32_t)(0x0000000FUL << MXC_F_WDT_CTRL_RST_PERIOD_POS))         /**< RST_PERIOD Field Mask - This field sets the time after an
                                                                                                                                  * interrupt period has expired before the device resets. If the
                                                                                                                                  * INT_PERIOD Flag is cleared prior to the RST_PERIOD expiration,
                                                                                                                                  * the device will not reset. */
#define MXC_F_WDT_CTRL_EN_TIMER_POS                         8                                                                   /**< EN_TIMER Field Position    */
#define MXC_F_WDT_CTRL_EN_TIMER                             ((uint32_t)(0x00000001UL << MXC_F_WDT_CTRL_EN_TIMER_POS))           /**< EN_TIMER Field Mask        */
#define MXC_F_WDT_CTRL_EN_CLOCK_POS                         9                                                                   /**< EN_CLOCK Field Position    */
#define MXC_F_WDT_CTRL_EN_CLOCK                             ((uint32_t)(0x00000001UL << MXC_F_WDT_CTRL_EN_CLOCK_POS))           /**< EN_CLOCK Field Mask        */
#define MXC_F_WDT_CTRL_WAIT_PERIOD_POS                      12                                                                  /**< WAIT_PERIOD Field Position */
#define MXC_F_WDT_CTRL_WAIT_PERIOD                          ((uint32_t)(0x0000000FUL << MXC_F_WDT_CTRL_WAIT_PERIOD_POS))        /**< WAIT_PERIOD Field Mask     */
/**@} end of group WDT_CTRL */
/**
 * @ingroup  wdt_registers
 * @defgroup WDT_FLAGS_Register WDT_FLAGS Register
 * @brief    Field Positions and Bit Masks for the WDT_FLAGS register. Watchdog Timer Flags for Interrupts and Reset.
 * @{
 */  
#define MXC_F_WDT_FLAGS_TIMEOUT_POS                         0                                                                   /**< TIMEOUT Flag Position */
#define MXC_F_WDT_FLAGS_TIMEOUT                             ((uint32_t)(0x00000001UL << MXC_F_WDT_FLAGS_TIMEOUT_POS))           /**< TIMEOUT Flag Mask - if this flag is set it indicates the Watchdog Timer timed out. */
#define MXC_F_WDT_FLAGS_PRE_WIN_POS                         1                                                                   /**< PRE_WIN Flag Position */
#define MXC_F_WDT_FLAGS_PRE_WIN                             ((uint32_t)(0x00000001UL << MXC_F_WDT_FLAGS_PRE_WIN_POS))           /**< PRE_WIN Flag Mask - If the PRE_WIN flag is set it indicates the Watchdog Timer was cleared by firmware writing to the WDT_CLEAR register <b><em> during the pre-window period</em></b>. */
#define MXC_F_WDT_FLAGS_RESET_OUT_POS                       2                                                                   /**< RESET_OUT Flag Position */
#define MXC_F_WDT_FLAGS_RESET_OUT                           ((uint32_t)(0x00000001UL << MXC_F_WDT_FLAGS_RESET_OUT_POS))         /**< RESET_FLAG Flag Mask - This flag indicates that the watchdog timer timed out and the reset period elapsed without the timer being cleared. This will result in a system restart. */
/**@} end of group WDT_FLAGS */

/**
 * @ingroup  wdt_registers
 * @defgroup WDT_ENABLE_Register WDT_ENABLE Register
 * @brief    Field Positions and Bit Masks for the WDT_ENABLE register. 
 * @{
 */
#define MXC_F_WDT_ENABLE_TIMEOUT_POS                        0                                                                   /**< ENABLE_TIMEOUT Field Position */
#define MXC_F_WDT_ENABLE_TIMEOUT                            ((uint32_t)(0x00000001UL << MXC_F_WDT_ENABLE_TIMEOUT_POS))          /**< ENABLE_TIMEOUT Field Mask */
#define MXC_F_WDT_ENABLE_PRE_WIN_POS                        1                                                                   /**< ENABLE_PRE_WIN Field Position */
#define MXC_F_WDT_ENABLE_PRE_WIN                            ((uint32_t)(0x00000001UL << MXC_F_WDT_ENABLE_PRE_WIN_POS))          /**< ENABLE_PRE_WIN Field Mask */
#define MXC_F_WDT_ENABLE_RESET_OUT_POS                      2                                                                   /**< ENABLE_RESET_OUT Field Position */
#define MXC_F_WDT_ENABLE_RESET_OUT                          ((uint32_t)(0x00000001UL << MXC_F_WDT_ENABLE_RESET_OUT_POS))        /**< ENABLE_RESET_OUT Field Mask */
/**@} end of group WDT_ENABLE */

/**
 * @ingroup  wdt_registers
 * @defgroup WDT_LOCK_CTRL_Register WDT_LOCK_CTRL Register
 * @brief    The WDT_LOCK_CTRL register controls read/write access to the \ref WDT_CTRL_Register.
 * @{
 */
#define MXC_F_WDT_LOCK_CTRL_WDLOCK_POS                      0                                                             /**< WDLOCK Field's position in the WDT_LOCK_CTRL register. */ 
#define MXC_F_WDT_LOCK_CTRL_WDLOCK                          ((uint32_t)(0x000000FFUL << MXC_F_WDT_LOCK_CTRL_WDLOCK_POS))  /**< WDLOCK Field mask for the WDT_LOCK_CTRL register.  Reading a value of */
/**@} end of group WDT_ENABLE */



